Ran Plan for dir: `atlantis-terraform-test` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_storage_bucket.this will be created
+ resource "google_storage_bucket" "this" {
      + effective_labels            = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + location                    = "US-CENTRAL1"
      + name                        = "atlantis-bucket-vamsi-test"
      + project                     = "vamsi-krishna-sandbox"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type          = "Delete"
                # (1 unchanged attribute hidden)
            }
          + condition {
              + age                    = 30
              + matches_prefix         = []
              + matches_storage_class  = []
              + matches_suffix         = []
              + with_state             = (known after apply)
                # (3 unchanged attributes hidden)
            }
        }

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # null_resource.example will be created
+ resource "null_resource" "example" {
      + id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d atlantis-terraform-test
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://viola-conditional-corrina.ngrok-free.dev/lock?id=VamsiKrishna082%252Fgitops-bridge-automation%252Fatlantis-terraform-test%252Fdefault%252F)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d atlantis-terraform-test
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```